package lessons29;

public class GoldArm {
    public static void main(String[] args) {
        //Нам известно, что в час он кладёт примерно один квадратный метр плитки.
        //Его час стоит 27€ без НДС.
        //Стандартная плитка 30 на 20 сантиметров.
        //Сергей Иванович обратился к нам за помощью и вам надо написать для него программу.
        //Которая будет принимать размеры стены/пола, стоимость плитки и выдавать:
        //Количество требуемых плиток, как целых, так и тех которые надо будет резать.
        // Учтите, что плитку можно класть как вдоль, так и поперёк и только на месте мастер узнает,
        // как именно её надо класть.

        //Стоимость материала
        //Стоимость рабочего времени
        //Итоговую ориентировочную стоимость
    }
}
